message_help = ('<b>ℹ️ Ласкаво просимо до нашого бот-маркетплейсу!</b>\n\n🌟 Тут Ви зможете розміщувати свої оголошення, '
                'переглядати оголошення інших користувачів та здійснювати інші дії, пов\'язані з торгівлею '
                'речами. \n\n✔️ Бот допоможе вам знайти потрібні товари або знайти покупця для ваших товарів. \n\n❗️ Якщо у вас '
                'виникли запитання або потрібна допомога, не соромтеся скористатися кнопкою <b><i>"❓ У мене є запитання"</i></b>'
                'нижче та вказати своє запитання. \n\n😊 Наша команда завжди рада допомогти вам!')
