from Markups.markups import start_bot_keyboard
from Markups.menu_markups import keyboard_menu


def send_message_with_username(bot, message, username):
    message_for_new_user = (
        f"🌟 <b>Привіт, {username}!</b>🌟 \n\n"
        f"🎉<b>Ласкаво просимо на наш маркетплейс!</b> \nМене звуть <b>SalesBot</b>, "
        f"і я тут, щоб допомогти Вам з продажем та покупкою речей. Перш ніж почати користуватися "
        f"всіма можливостями маркетплейсу, нам потрібно трохи інформації від Вас 😏 \n\n"
        f"📝 <b>Інформація, яку ми потребуємо:</b>\n"
        f"Мені потрібно буде Ваше <i>ім'я</i>, <i>електронна пошта</i> та "
        f"<i>номер телефону</i>. Це допоможе нам забезпечити безпеку Вашого облікового запису та "
        f"зручний зв'язок з Вами. Після підтвердження Вашої електронної пошти, Ви зможете розміщувати "
        f"оголошення про продаж або шукати товари для покупки 🥰\n\n"
        f"📧 <b>Чекаю на Ваші дані!</b>\n"
        f"Отже, натисність кнопку <b>'<i>🚀 Почати роботу з ботом</i>'</b> для розпочатку нашої спільної роботи ☺️"
    )

    bot.send_message(message.chat.id, message_for_new_user, parse_mode='HTML',
                     reply_markup=start_bot_keyboard)


name_request_message = (
    "🌟 <b>Будь ласка, надішліть Ваше ім'я</b>\n\n"
    "❗ Вкажіть Ваше ім'я, яке починається з великої літери, та складається з букв "
    "українського алфавіту. \n\n<b>📝 Наприклад:</b> <i>'Назар Луців'</i>\n\n"
    "❗<i>Ми використовуємо Ваше ім'я для зручного звертання до Вас та підтримки нашого спілкування</i>"
)

name_error_message = (
    "❌ <b>Неправильний формат імені</b> "
    "\n\n❗ Надішліть ім'я у форматі: <i>'Ім'я Прізвище'</i> "
)

phone_request_message = (
    "🌟 <b>Поділіться своїм номером телефону</b>\n\n"
    "❗ Натисніть на кнопку <b>'📱 Поділитися номером телефону</b>'\n\n"
    "❗ <i>Це потрібно для підтвердження Вашого облікового запису та забезпечення безпеки "
    "відомостей у нашій системі</i>"
)

phone_error_request_message = (
    "❌ <b>Будь ласка, використовуйте кнопку \"📱 Поділитися номером телефону\"</b>\n\n"
    "❗ Натисніть на кнопку нижче, щоб поділитися своїм номером телефону.\n\n"
)


email_request_message = (
    "📧 <b>Будь ласка, надішліть свою електронну скриньку</b>\n\n"
    "❗ На Вашу електронну скриньку буде надіслано код підтвердження\n\n"
    "📝<b>Приклад електронної пошти:</b> example@example.com\n\n"
    "❗<i>Електронна скринька також потрібна для видалення облікового запису, отримання важливих повідомлень "
    "щодо вашого аккаунту та діяльності на маркетплейсі.</i>"
)

invalid_email_message = ("❌ <b>Неправильний формат електронної пошти</b>"
                         "\n\n❗ Надішліть електронну пошту у форматі:\n'example@example.com'")


confirmation_code_message = (
    "📧 <b>Надішліть код підтвердження</b>, який ми надіслали на Вашу електронну пошту\n\n"
)


def send_message_with_user_mail(bot, message, user_mail):
    email_confirmation_message = (
        "<b>🎉 Ви успішно підтвердили пошту </b>\n\n"
        f"✉️ Ваша пошта: <b>{user_mail}</b>\n\n"
        "🥰 Тепер Ви можете насолоджуватися усіма можливостями нашого маркетплейсу та розміщувати оголошення про продаж "
        "або шукати товари для покупки\n\n❗ Якщо у Вас виникнуть питання або потрібна допомога, не соромтеся звертатися "
        "до нас. Ми завжди раді допомогти! 😊"
    )

    bot.send_message(message.chat.id, email_confirmation_message, parse_mode='HTML',
                     reply_markup=keyboard_menu)


invalid_code_message = "❌ <b>Неправильний код підтвердження</b> \n\n❗ Спробуйте ще раз..."
