category_selection_message = (
    "1️⃣ <b>Оберіть категорію</b>, до якої відноситься ваш товар\n\n"
    "📝 <b>Наприклад:</b> <i>'Електроніка', 'Одяг', 'Транспорт' тощо</i>"
)

category_error_selection_message = (
    "🌟 <b>Потрібно обрати категорію зі списку</b>\n\n"
    "📝 <b>Наприклад:</b> <i>'Електроніка', 'Одяг', 'Транспорт' тощо</i>"
)


def generate_subcategory_message(category):
    subcategory_selection_message = f"2️⃣ <b>Оберіть підкатегорію для '{category}'</b>\n\n<i>❗️ Оберіть підкатегорію, яка найкраще відповідає вашому товару</i>"
    return subcategory_selection_message


subcategory_error_selection_message = (
    "<b>🌟 Потрібно обрати підкатегорію зі списку</b>\n\n"
    "<i>❗️ Оберіть підкатегорію, яка найкраще відповідає вашому товару</i>"
)


def confirmation_message_category_subcategory(category, subcategory):
    category_and_subcategory_selection_message = f"❗️ <b>Ви обрали:</b>\n<b>Категорію:</b> {category}\n<b>Підкатегорію:</b> {subcategory}"
    return category_and_subcategory_selection_message


title_input_message = (
    "<b>3️⃣ Введіть назву оголошення</b>\n\n"
    "<i>❗️ Назва оголошення повинна чітко описувати предмет оголошення, бути короткою і описовою, щоб залучити увагу користувачів</i>"
    "\n\n📝 <b>Наприклад:</b> <i>'Продам новий iPhone 12 Pro Max 256GB'</i>"
)

name_length_error_message = "<b>❌ Назва оголошення не повинна перевищувати 40 символів</b>\n\n <i>❗️ Будь ласка, введіть коротшу назву </i>"

description_input_message = (
    "<b>4️⃣ Введіть опис оголошення</b>\n\n"
    "<i>❗️ Опис оголошення повинен чітко відображати основні характеристики товару або послуги, бути коротким і зрозумілим для користувачів</i>"
    "\n\n📝 <b>Наприклад:</b> <i>'Новий iPhone 12 Pro Max 256GB у відмінному стані, з гарантією. Додаткові фото можу надіслати в особисті повідомлення'</i>"
)

description_length_error_message = "<b>❌ Опис оголошення не повинен перевищувати 650 символів</b>\n\n <i>❗️ Будь ласка, введіть коротний опис</i>"

photo_input_message = (
    "<b>5️⃣ Надішліть фото для оголошення</b>\n\n"
    "<i>❗️ Будь ласка, надішліть фотографії вашого товару або послуги, щоб користувачі могли краще оцінити його.\n"
    "<b>Можна надіслати до 5 фотографій (НАДСИЛАТИ ПО 1шт.)</b></i>"
)

photo_error_message = (
    "<b>❌ Вибачте, але ви не надіслали фотографію</b>\n\n <i>❗️ Будь ласка, спробуйте ще раз надіслати фото для "
    "вашого оголошення</i>"
)

price_input_message = (
    "<b>6️⃣ Введіть ціну оголошення <i>(в гривнях)</i></b>\n\n"
    "📝 <b>Наприклад:</b> <i>'1500', '2000', '5500'</i>"
)

price_error_message = (
    "❌ <b>Ціна оголошення повинна бути в межах від <i>0 до 100 000 000</i> грн</b>\n\n❗️ <i>Будь ласка, введіть коректну ціну</i>"
)

non_correct_price_error_message = (
    "❌ <b>Некоректне значення ціни</b>"
)

condition_selection_message = (
    f"7️⃣ <b>Оберіть стан оголошення</b>"
)

incorrect_condition_message = "<b>❌ Некоректне значення стану оголошення</b>\n\n<i>❗️ Будь ласка, оберіть <b>'Нове'</b> або <b>'Вживане'</b></i>"



region_selection_message = (
    "8️⃣ <b>Оберіть Вашу область</b>, де Ви знаходитесь\n\n"
    "🌍 <b>Примітка:</b> <i>область допоможе користувачам знаходити Ваше оголошення у відповідному регіоні</i>"
)

error_region_selection_message = (
    "🌟  <b>Потрібно обрати область зі списку</b>\n\n"
    "🌍 <b>Примітка:</b> <i>область допоможе користувачам знаходити Ваше оголошення у відповідному регіоні</i>"
)


def select_city_message(region):
    city_selection_message = (f"8️⃣ <b>Оберіть Ваше місто в {region}</b>\n\n🌍 <b>Примітка:</b> <i>Оберіть місто з "
                              f"переліку, щоб точно вказати місцезнаходження вашого товару\n\n<b>Якщо Ваш населений пнукт "
                              f"відсутній у списку, то оберіть найближчий до Вас</b></i>")

    return city_selection_message


error_city_selection_message = (
    "🌟  <b>Потрібно обрати місто зі списку</b>\n\n"
    "🌍 <b>Примітка:</b> <i>Оберіть місто з "
                              f"переліку, щоб точно вказати місцезнаходження вашого товару\n\n<b>Якщо Ваш населений пнукт "
                              f"відсутній у списку, то оберіть найближчий до Вас</b></i>"
)

announcement_success_message = (
    "<b>🎉 Оголошення успішно створено</b>\n\n"
    "<b>📝 Примітка:</b> <i>Ваше оголошення надіслано на модерацію. Наші модератори перевірять його найближчим часом. "
    "Після підтвердження ваше оголошення стане активним і буде доступне для перегляду іншим користувачам</i>"
    "\n\n<b>Дякуємо за користування нашим сервісом 🚀</b>"
)



